In [31]:
import mysql.connector

mydb = mysql.connector.connect(
    host="localhost",
    user="root",
    passwd="raw123"
    ,database="ucberkeley"
)

print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x0000025A1E64B0B8>

In [32]:
# Create Database
mycursor = mydb.cursor()

mycursor.execute("CREATE DATABASE IF NOT EXISTS `ucberkeley`")

In [33]:
# Show Databases
mycursor.execute("SHOW DATABASES")

for x in mycursor:
    print(x)

('information_schema',)
('mysql',)
('performance_schema',)
('sakila',)
('tawaenet_rawasy',)
('test',)
('ucberkeley',)
('world',)
('yamaniun_maknaoudhq',)
('youthnet_youthrev',)
('youthnet_youthrev2',)

In [8]:
mycursor = mydb.cursor()

#mycursor.execute("CREATE TABLE IF NOT EXISTS `customers` (`id` int(11) NOT NULL AUTO_INCREMENT, `name` varchar(255) DEFAULT NULL, `address` varchar(255) DEFAULT NULL, PRIMARY KEY (`id`))ENGINE=InnoDB DEFAULT CHARSET=latin1")
mycursor.execute("CREATE TABLE IF NOT EXISTS `customers` (`id` int(11) NOT NULL AUTO_INCREMENT, `name` varchar(255) DEFAULT NULL, `address` varchar(255) DEFAULT NULL, PRIMARY KEY (`id`))ENGINE=InnoDB DEFAULT CHARSET=utf8")

In [15]:
# Alter Table

#mycursor.execute("ALTER TABLE `customers` ADD COLUMN `id` int(11) NOT NULL AUTO_INCREMENT PRIMARY KEY")
mycursor.execute("ALTER TABLE `customers` CHANGE COLUMN `id` `id` int(11) NOT NULL AUTO_INCREMENT")

In [18]:
sql = "INSERT INTO `customers` (`name`, `address`) VALUES (%s, %s)"
val = ("Khaled Karman", "453 Buena Vista Avenue #107")
mycursor.execute(sql, val)

mydb.commit()

print(mycursor.rowcount, "record inserted.", ", ID:", mycursor.lastrowid)

1 record inserted. , ID: 15

In [17]:
# Multiple insert
sql = "INSERT INTO `customers` (`name`, `address`) VALUES (%s, %s)"
val = [
  ('Peter', 'Lowstreet 4'),
  ('Amy', 'Apple st 652'),
  ('Hannah', 'Mountain 21'),
  ('Michael', 'Valley 345'),
  ('Sandy', 'Ocean blvd 2'),
  ('Betty', 'Green Grass 1'),
  ('Richard', 'Sky st 331'),
  ('Susan', 'One way 98'),
  ('Vicky', 'Yellow Garden 2'),
  ('Ben', 'Park Lane 38'),
  ('William', 'Central st 954'),
  ('Chuck', 'Main Road 989'),
  ('Viola', 'Sideway 1633')
]

mycursor.executemany(sql, val)

mydb.commit()

print(mycursor.rowcount, "was inserted.")

13 was inserted.

In [28]:
# Select from table
mycursor = mydb.cursor()

mycursor.execute("SELECT * FROM `customers`")

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

(1, 'Khaled Karman', '453 Buena Vista Avenue #107')
(2, 'Peter', 'Lowstreet 4')
(3, 'Amy', 'Apple st 652')
(4, 'Hannah', 'Mountain 21')
(5, 'Michael', 'Valley 345')
(6, 'Sandy', 'Ocean blvd 2')
(7, 'Betty', 'Green Grass 1')
(8, 'Richard', 'Sky st 331')
(9, 'Susan', 'One way 98')
(10, 'Vicky', 'Yellow Garden 2')
(11, 'Ben', 'Park Lane 38')
(12, 'William', 'Central st 954')
(13, 'Chuck', 'Main Road 989')
(14, 'Viola', 'Sideway 1633')
(15, 'Khaled Karman', '453 Buena Vista Avenue #107')

In [29]:
# Select one record from table
mycursor = mydb.cursor()

mycursor.execute("SELECT * FROM customers")

myresult = mycursor.fetchone()

print(myresult)

(1, 'Khaled Karman', '453 Buena Vista Avenue #107')

In [34]:
# Start from position 3, and return 5 records
mycursor = mydb.cursor()

mycursor.execute("SELECT * FROM customers LIMIT 5 OFFSET 2")

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

(3, 'Amy', 'Apple st 652')
(4, 'Hannah', 'Mountain 21')
(5, 'Michael', 'Valley 345')
(6, 'Sandy', 'Ocean blvd 2')
(7, 'Betty', 'Green Grass 1')